let distance = 0; // разстояние в метри
let time = 0; // време в секунди

setInterval(() => {
  const speed = distance / time * 3.6; // изчисляване на скоростта в км/ч

  console.log(`Скорост: ${speed.toFixed(2)} км/ч`); // извеждане на скоростта в конзолата
}, 5000); // измерване на скоростта на всеки 5 секунди

// Симулиране на движение на обект
setInterval(() => {
  const randomDistance = Math.floor(Math.random() * 100); // генериране на случайна дистанция
  distance += randomDistance; // добавяне на дистанцията към общото разстояние

  time += 1; // увеличаване на времето

  console.log(`Изминали ${distance} метра за ${time} секунди`); // извеждане на информация за пройденото разстояние в конзолата
}, 1000); // променяме разстоянието на всеки 1 секунда
